{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Computer Science",
    "1": "Statistics",
    "2": "Physics",
    "3": "Quantitative Biology",
    "4": "Electrical Engineering and Systems Science",
    "5": "Mathematics",
    "6": "Quantitative Finance",
    "7": "Economics"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Computer Science": 0,
    "Economics": 7,
    "Electrical Engineering and Systems Science": 4,
    "Mathematics": 5,
    "Physics": 2,
    "Quantitative Biology": 3,
    "Quantitative Finance": 6,
    "Statistics": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "use_cache": false,
  "vocab_size": 30522
}
